; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite4 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite5 - satellite
	instrument8 - instrument
	image2 - mode
	thermograph1 - mode
	infrared0 - mode
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation6 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	Star0 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Star12 - direction
	Star13 - direction
	Star14 - direction
	Phenomenon15 - direction
)
(:init
	(supports instrument0 image2)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon7)
	(supports instrument1 image2)
	(calibration_target instrument1 GroundStation4)
	(supports instrument2 image2)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation6)
	(supports instrument3 thermograph1)
	(supports instrument3 infrared0)
	(calibration_target instrument3 Star0)
	(calibration_target instrument3 GroundStation5)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon10)
	(supports instrument4 infrared0)
	(calibration_target instrument4 GroundStation6)
	(supports instrument5 thermograph1)
	(supports instrument5 image2)
	(supports instrument5 infrared0)
	(calibration_target instrument5 Star0)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation2)
	(supports instrument6 image2)
	(supports instrument6 infrared0)
	(supports instrument6 thermograph1)
	(calibration_target instrument6 GroundStation4)
	(calibration_target instrument6 GroundStation3)
	(supports instrument7 image2)
	(calibration_target instrument7 GroundStation5)
	(on_board instrument6 satellite4)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet11)
	(supports instrument8 image2)
	(supports instrument8 infrared0)
	(calibration_target instrument8 Star0)
	(on_board instrument8 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star13)
)
(:goal (and
	(pointing satellite0 GroundStation4)
	(pointing satellite1 GroundStation4)
	(pointing satellite3 Phenomenon10)
	(pointing satellite5 Phenomenon10)
	(have_image Phenomenon7 image2)
	(have_image Planet8 image2)
	(have_image Phenomenon9 infrared0)
	(have_image Phenomenon10 thermograph1)
	(have_image Planet11 thermograph1)
	(have_image Star12 image2)
	(have_image Star13 image2)
	(have_image Star14 image2)
	(have_image Phenomenon15 thermograph1)
))

)

; plan
1. (turn_to satellite3 star0 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 star0)
   goals met: 0 of 13
2. (switch_on instrument5 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument5)
   goals met: 0 of 13
3. (calibrate satellite3 instrument5 star0)
   added: (calibrated instrument5)
   goals met: 0 of 13
4. (turn_to satellite3 phenomenon9 star0)
   deleted: (pointing satellite3 star0)
   added: (pointing satellite3 phenomenon9)
   goals met: 0 of 13
5. (take_image satellite3 phenomenon9 instrument5 infrared0)
   added: (have_image phenomenon9 infrared0)
   goals met: 1 of 13
6. (turn_to satellite3 phenomenon7 phenomenon9)
   deleted: (pointing satellite3 phenomenon9)
   added: (pointing satellite3 phenomenon7)
   goals met: 1 of 13
7. (take_image satellite3 phenomenon7 instrument5 image2)
   added: (have_image phenomenon7 image2)
   goals met: 2 of 13
8. (turn_to satellite3 phenomenon15 phenomenon7)
   deleted: (pointing satellite3 phenomenon7)
   added: (pointing satellite3 phenomenon15)
   goals met: 2 of 13
9. (turn_to satellite1 groundstation4 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 groundstation4)
   goals met: 3 of 13
10. (turn_to satellite0 groundstation4 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 groundstation4)
   goals met: 4 of 13
11. (take_image satellite3 phenomenon15 instrument5 thermograph1)
   added: (have_image phenomenon15 thermograph1)
   goals met: 5 of 13
12. (turn_to satellite3 planet11 phenomenon15)
   deleted: (pointing satellite3 phenomenon15)
   added: (pointing satellite3 planet11)
   goals met: 5 of 13
13. (take_image satellite3 planet11 instrument5 thermograph1)
   added: (have_image planet11 thermograph1)
   goals met: 6 of 13
14. (turn_to satellite3 planet8 planet11)
   deleted: (pointing satellite3 planet11)
   added: (pointing satellite3 planet8)
   goals met: 6 of 13
15. (take_image satellite3 planet8 instrument5 image2)
   added: (have_image planet8 image2)
   goals met: 7 of 13
16. (turn_to satellite3 star12 planet8)
   deleted: (pointing satellite3 planet8)
   added: (pointing satellite3 star12)
   goals met: 7 of 13
17. (take_image satellite3 star12 instrument5 image2)
   added: (have_image star12 image2)
   goals met: 8 of 13
18. (turn_to satellite3 star13 star12)
   deleted: (pointing satellite3 star12)
   added: (pointing satellite3 star13)
   goals met: 8 of 13
19. (take_image satellite3 star13 instrument5 image2)
   added: (have_image star13 image2)
   goals met: 9 of 13
20. (turn_to satellite3 star14 star13)
   deleted: (pointing satellite3 star13)
   added: (pointing satellite3 star14)
   goals met: 9 of 13
21. (take_image satellite3 star14 instrument5 image2)
   added: (have_image star14 image2)
   goals met: 10 of 13
22. (turn_to satellite3 phenomenon10 star14)
   deleted: (pointing satellite3 star14)
   added: (pointing satellite3 phenomenon10)
   goals met: 11 of 13
23. (take_image satellite3 phenomenon10 instrument5 thermograph1)
   added: (have_image phenomenon10 thermograph1)
   goals met: 12 of 13
24. (turn_to satellite5 phenomenon10 star13)
   deleted: (pointing satellite5 star13)
   added: (pointing satellite5 phenomenon10)
   goals met: 13 of 13
